using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Oztarnik.FsViewer
{
    public static class FsSort
    {
        // Define the custom order for directories
        public static string[] DirectoryOrder = new string[] 
        {
            "תנך", "מדרש", "משנה", "תוספתא", "תלמוד בבלי", "תלמוד ירושלמי", "הלכה", "שות", "קבלה", "ספרי מוסר", "חסידות", "מחשבת ישראל", "סדר התפילה", "ספרות עזר", "אודות התוכנה" ,
                    "תורה", "נביאים", "כתובים", "תרגומים", "ראשונים", "אחרונים",

           //רמבם
                "הקדמה", "ספר אהבה", "ספר הפלאה", "ספר זמנים", "ספר זרעים", "ספר טהרה", "ספר מדע", "ספר משפטים", "ספר נזיקין", "ספר נשים", "ספר עבודה", "ספר קדושה", "ספר קורבנות", "ספר קניין", "ספר שופטים"


        };

        // Define the custom order for file names (Hebrew book names)
        public static string[] FileOrder = new string[]
         {
            // תורה
            "בראשית", "שמות", "ויקרא", "במדבר", "דברים",

            // נביאים ראשונים
            "יהושע", "שופטים", "שמואל א", "שמואל ב", "מלכים א", "מלכים ב",

            // נביאים אחרונים
            "ישעיהו", "ירמיהו", "יחזקאל",
            "הושע", "יואל", "עמוס", "עובדיה", "יונה", "מיכה",
            "נחום", "חבקוק", "צפניה", "חגי", "זכריה", "מלאכי",

            // כתובים
            "תהלים", "משלי", "איוב",
            "שיר השירים", "רות", "איכה", "קהלת", "אסתר",
            "דניאל", "עזרא", "נחמיה", "דברי הימים א", "דברי הימים ב",

           // רשימת מסכתות
"ברכות", "שבת", "עירובין", "פסחים", "שקלים",
"יומא", "סוכה", "ביצה", "ראש השנה", "תענית",
"מגילה", "מועד קטן", "חגיגה", "יבמות", "כתובות",
"נדרים", "נזיר", "סוטה", "גיטין", "קידושין",
"בבא קמא", "בבא מציעא", "בבא בתרא", "סנהדרין",
"מכות", "שבועות", "עבודה זרה", "הוריות", "זבחים",
"מנחות", "חולין", "בכורות", "ערכין", "תמורה",
"כריתות", "מעילה", "תמיד", "מדות", "קינים",
"נידה", "פאה", "דמאי", "כלאיים", "שביעית",
"תרומות", "מעשרות", "מעשר שני", "חלה", "ערלה",
"ביכורים", "כלים", "אהלות", "נגעים", "פרה",
"טהרות", "מקוואות", "מכשירין", "זבים", "טבול יום",
"ידים", "עוקצים",

// מסכתות קטנות
"סופרים", "אבות דרבי נתן", "סמכות", "ספר תורה",
"תפילין", "מזוזה", "ציצית", "גרים", "עבדים",
"כוחות", "שמחות", "כלה", "דרך ארץ רבה",
"דרך ארץ זוטא",

//שלחן ערוך
"אורח חיים", "יורה דעה" ,"אבן העזר", "חושן משפט",

//רמבם

//מדע
    "הלכות יסודי התורה", "הלכות דעות", "הלכות תלמוד תורה", "הלכות עבודה זרה וחוקות הגויים", "הלכות תשובה",

    //אהבה
    "הלכות קריאת שמע", "הלכות תפילה וברכת כהנים", "הלכות תפילין ומזוזה וספר תורה", "הלכות ציצית", "הלכות ברכות", "הלכות מילה", "סדר התפילה",

    //זמנים
    "הלכות שבת", "הלכות עירובין", "הלכות שביתת עשור", "הלכות שביתת יום טוב", "הלכות חמץ ומצה", "הלכות שופר וסוכה ולולב", "הלכות שקלים", "הלכות קידוש החודש", "הלכות תעניות", "הלכות מגילה וחנוכה",

    //נשים
    "הלכות אישות", "הלכות גירושין", "הלכות יבום וחליצה", "הלכות נערה בתולה", "הלכות סוטה",

    //קדושה
    "הלכות איסורי ביאה", "הלכות מאכלות אסורות", "הלכות שחיטה",  
    //הפלאה
    "הלכות שבועות", "הלכות נדרים", "הלכות נזירות", "ערכים וחרמין",

    //זרעים
    "הלכות כלאים", "הלכות מתנות עניים", "הלכות תרומות", "הלכות מעשרות", "הלכות מעשר שני ונטע רבעי", "הלכות ביכורים ושאר מתנות כהונה שבגבולין", "הלכות שמיטה ויובל",

    //עבודה
    "הלכות בית הבחירה", "הלכות כלי המקדש והעובדין בו", "הלכות ביאת מקדש", "הלכות איסורי המזבח", "הלכות מעשה הקרבנות", "הלכות תמידים ומוספין", "הלכות פסולי המוקדשין", "הלכות עבודת יום הכפורים", "הלכות מעילה",

    //קרבנות
    "הלכות קרבן פסח", "הלכות חגיגה", "הלכות בכורות", "הלכות שגגות", "הלכות מחוסרי כפרה", "הלכות תמורה",

    //טהרה
    "טומאת מת", "הלכות פרה אדומה", "הלכות טומאת צרעת", "הלכות מטמאי משכב ומושב", "הלכות שאר אבות הטומאות", "הלכות טומאת אוכלים", "הלכות כלים", "הלכות מקואות",

    //נזיקין
    "נזקי ממון", "הלכות גניבה", "הלכות גזילה ואבידה", "הלכות חובל ומזיק", "הלכות רוצח ושמירת נפש",  

    //קנין
    "מכירה", "הלכות זכייה ומתנה", "הלכות שכנים", "הלכות שלוחין ושותפין", "הלכות עבדים",

    //משפטים
    "שכירות", "הלכות שאלה ופיקדון", "הלכות מלווה ולווה", "הלכות טוען ונטען", "הלכות נחלות",

    //שופטים
    "סנהדרין והעונשין המסורין להם", "הלכות עדות", "הלכות ממרים", "הלכות אבל", "הלכות מלכים ומלחמות",

    };
    }
}
