using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Oztarnik.FsViewer
{
    public static class FsSort
    {
        // Define the custom order for directories
        public static string[] DirectoryOrder = new string[] { "תנך", "מדרש", "משנה", "תוספתא", "תלמוד בבלי", "תלמוד ירושלמי", "הלכה", "שות", "קבלה", "ספרי מוסר", "חסידות", "מחשבת ישראל", "סדר התפילה", "ספרות עזר", "אודות התוכנה" ,
                    "תורה", "נביאים", "כתובים", "תרגומים", "ראשונים", "אחרונים"};

        // Define the custom order for file names (Hebrew book names)
        public static string[] FileOrder = new string[]
         {
            // תורה
            "בראשית", "שמות", "ויקרא", "במדבר", "דברים",

            // נביאים ראשונים
            "יהושע", "שופטים", "שמואל א", "שמואל ב", "מלכים א", "מלכים ב",

            // נביאים אחרונים
            "ישעיהו", "ירמיהו", "יחזקאל",
            "הושע", "יואל", "עמוס", "עובדיה", "יונה", "מיכה",
            "נחום", "חבקוק", "צפניה", "חגי", "זכריה", "מלאכי",

            // כתובים
            "תהלים", "משלי", "איוב",
            "שיר השירים", "רות", "איכה", "קהלת", "אסתר",
            "דניאל", "עזרא", "נחמיה", "דברי הימים א", "דברי הימים ב",

            // תלמוד
             "ברכות", "שבת", "עירובין", "פסחים", "שקלים",
            "יומא", "סוכה", "ביצה", "ראש השנה", "תענית",
            "מגילה", "מועד קטן", "חגיגה", "יבמות", "כתובות",
            "נדרים", "נזיר", "סוטה", "גיטין", "קידושין",
            "בבא קמא", "בבא מציעא", "בבא בתרא", "סנהדרין",
            "מכות", "שבועות", "עבודה זרה", "הוריות", "זבחים",
            "מנחות", "חולין", "בכורות", "ערכין", "תמורה",
            "כריתות", "מעילה", "תמיד", "מדות", "קינים",
            "נידה"
         };
    }
}
